{
  "Q000": {
    "code": "Q000",
    "rationale": "Consistent use of double quotes improves code readability and follows Python community conventions. It also makes it easier to include apostrophes in strings without escaping.",
    "csmPrinciples": "This rule supports CSM's emphasis on consistency and readability. Consistent quote usage reduces cognitive load when reading code and makes the codebase more maintainable."
  },
  "E501": {
    "code": "E501",
    "rationale": "Shorter lines improve readability, especially on smaller screens. They also make it easier to compare code side-by-side.",
    "csmPrinciples": "Clear Layout"
  },
  "E302": {
    "code": "E302",
    "rationale": "Two blank lines provide clear visual separation between top-level elements, making the code structure more apparent and easier to navigate.",
    "csmPrinciples": "This rule supports CSM's structure principle by creating clear visual boundaries that help readers understand the code's organization."
  },
  "E303": {
    "code": "E303",
    "rationale": "Excessive blank lines can make code harder to read and navigate. Consistent spacing helps maintain visual clarity.",
    "csmPrinciples": "This rule supports CSM's consistency principle by maintaining appropriate visual spacing throughout the code."
  },
  "CSM1": {
    "code": "CSM1",
    "rationale": "Two blank lines before top-level functions and classes provide clear visual separation and improve code readability.",
    "csmPrinciples": "Clear Layout"
  },
  "CSM2": {
    "code": "CSM2",
    "rationale": "Two blank lines after top-level functions and classes provide clear visual separation and improve code readability.",
    "csmPrinciples": "Clear Layout"
  },
  "CSM3": {
    "code": "CSM3",
    "rationale": "One blank line between methods provides clear visual separation while maintaining the visual grouping of class members.",
    "csmPrinciples": "This rule supports CSM's structure principle by creating appropriate visual hierarchy within class definitions."
  },
  "CSM4": {
    "code": "CSM4",
    "rationale": "Proper placement of dunder assignments (like __version__, __author__) follows Python conventions and improves code organization.",
    "csmPrinciples": "This rule supports CSM's structure principle by ensuring consistent and logical organization of module elements."
  },
  "C0103": {
    "code": "C0103",
    "rationale": "Consistent naming conventions help other developers understand the purpose and scope of variables, functions, and classes at a glance, thus reducing cognitive overload.",
    "csmPrinciples": "Explanatory Language"
  },
  "D100": {
    "code": "D100",
    "rationale": "Developers should document the purposes of their work to give context into usage and the project as a whole.",
    "csmPrinciples": "Explanatory Language"
  },
  "D103": {
    "code": "D103",
    "rationale": "Developers should document the purposes of their work to give context into usage and the project as a whole.",
    "csmPrinciples": "Explanatory Language"
  },
  "unused import": {
    "code": "VULTURE_UNUSED_IMPORT",
    "rationale": "Unused imports clutter the code and may confuse readers. Removing them improves code clarity and reduces unnecessary dependencies.",
    "csmPrinciples": "No Unused Content"
  },
  "unused variable": {
    "code": "VULTURE_UNUSED_VARIABLE",
    "rationale": "Unused variables can indicate incomplete code or logic errors. Removing them makes the codebase cleaner and easier to understand.",
    "csmPrinciples": "No Unused Content"
  },
  "E225": {
    "code": "E225",
    "rationale": "Whitespace around operators makes them stand out in expressions and therefore leads to quick comprehension.",
    "csmPrinciples": "Clear Layout"
  },
  "ERA001": {
    "code": "ERA001",
    "rationale": "Unused code should be removed to reduce mental effort.",
    "csmPrinciples": "No Unused Content"
  }
}
